xehp/hello_world_stm32/hello_stm32/src/serialDev.c
/*
https://github.com/xehp/hello_world_stm32

Copyright (C) 2021 Alexander & Henrik Bjorkman www.eit.se/hb.

Permission to use, copy, modify, and/or distribute this software for any
purpose with or without fee is hereby granted, provided that the above
copyright notice and this permission notice appear in all copies.

THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT
OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.

Barebone blinky on nucleo L432KC / stm32l432kc using SysTick. No RTOS needed.

References
[1] DocID027295 Rev 3, http://www.st.com/content/ccc/resource/technical/document/reference_manual/group0/b0/ac/3e/8f/6d/21/47/af/DM00151940/files/DM00151940.pdf/jcr:content/translations/en.DM00151940.pdf
[2] Device Summary STM32L431xx DS11453 Rev 3 (stm32l431kc.pdf)
[3] Reference Manual RM0394 Rev 4 (en.DM00151940.pdf)
[4] RM0038 Rev 16
[5] DocID024330 Rev 5

Ref [4] found at:
https://www.st.com/en/microcontrollers-microprocessors/stm32l151-152.html#documentation
*/

#if (defined STM32L432xx)
#include "stm32l4xx_hal_gpio_ex.h"
#elif (defined STM32L151xB)
#include "stm32l1xx_hal_gpio_ex.h"
#elif (defined STM32F303x8)
#include "stm32f3xx_hal_gpio_ex.h"
#else
#error Unknown device
#endif

#include "sys.h"
#include "cfg.h"
#include "miscUtilities.h"
#include "fifo.h"
#include "serialDev.h"


// Macros for compatibility with older versions of HAL, these can be removed later some day.
/*
#ifndef USART_ISR_RXNE_Msk
#define USART_ISR_RXNE_Msk USART_ISR_RXNE
#endif
#ifndef USART_ISR_TXE_Msk
#define USART_ISR_TXE_Msk USART_ISR_TXE
#endif
#ifndef USART_CR1_TXEIE_Msk
#define USART_CR1_TXEIE_Msk USART_CR1_TXEIE
#endif
#ifndef USART_CR1_UE_Msk
#define USART_CR1_UE_Msk USART_CR1_UE
#endif
#ifndef RCC_APB2ENR_USART1EN_Msk
#define RCC_APB2ENR_USART1EN_Msk RCC_APB2ENR_USART1EN
#endif
#ifndef RCC_APB1ENR_USART2EN_Msk
#define RCC_APB1ENR_USART2EN_Msk RCC_APB1ENR_USART2EN
#endif
#ifndef USART_CR1_TE_Msk
#define USART_CR1_TE_Msk USART_CR1_TE
#endif
#ifndef USART_CR2_CLKEN_Msk
#define USART_CR2_CLKEN_Msk USART_CR2_CLKEN
#endif
#ifndef USART_CR1_RE_Msk
#define USART_CR1_RE_Msk USART_CR1_RE
#endif
#ifndef USART_CR1_RXNEIE_Msk
#define USART_CR1_RXNEIE_Msk USART_CR1_RXNEIE
#endif
*/


#ifdef LPUART1_BAUDRATE
	// LPUART1 is not available in an STM32L1 device but is available in STM32L4.

	// NOTE Two uarts, usarts etc shall not use same pins.
	// For example USART2 and LPUART1 can not both use PA2.
    // NOTE If PA2 and PA3 are used for LPUART1 then USART2 can not also use these pins.

    // LPUART1_TX_PIN can be set to 2 or 11 here for PA2 or PB11 respectively.
	#define LPUART1_TX_PIN 2

    // LPUART1_TX_PIN can be set to 3 or 10 here for PA3 or PB10 respectively.
	#define LPUART1_RX_PIN 3

	volatile struct Fifo lpuart1In = {0,0,{0}};
	#ifdef LPUART1_TX_PIN
	volatile struct Fifo lpuart1Out = {0,0,{0}};
	#endif
#endif

#if (defined USART1_BAUDRATE)
volatile struct Fifo usart1In = {0,0,{0}};
volatile struct Fifo usart1Out = {0,0,{0}};
#endif

#ifdef USART2_BAUDRATE

	// Do we support sending on Usart2. Comment this out if not needed.
    // Typical transmit pin is PA2, but PD5 may be possible to use on some devices.
    // USART2_TX_PIN can be set to 2 or 5 here for PA2 or PD5 respectively.
	#define USART2_TX_PIN 2

	// On which pin shall Usart2 transmit, use 3 or 15.
	// On Nucleo PA3 does not work via stlink (PA2 does work for sending), use PA_15 for usart2 RX instead.
	// https://community.st.com/s/question/0D50X00009XkYKK/usart-vcp-connections-on-nucleol432kc
    // USART2_RX_PIN can be set to 3, 15 or 6 here for PA3, PA15 or PD6 respectively.
	#if (defined STM32L432xx)
	#define USART2_RX_PIN 15
	#else
	#define USART2_RX_PIN 3
	#endif


	#ifdef USART2_RX_PIN
	volatile struct Fifo usart2In = {0,0,{0}};
	#endif

	#ifdef USART2_TX_PIN
	volatile struct Fifo usart2Out = {0,0,{0}};
	#endif
#endif

#ifdef USART3_BAUDRATE
	volatile struct Fifo usart3In = {0,0,{0}};
	volatile struct Fifo usart3Out = {0,0,{0}};
#endif


#if (defined STM32L432xx) || (defined STM32F303x8)

	#ifdef LPUART1_BAUDRATE
	void __attribute__ ((interrupt, used)) LPUART1_IRQHandler(void)
	{
	  volatile uint32_t tmp = LPUART1->ISR;

	  // RXNE (Receive not empty)
	  if (tmp & USART_ISR_RXNE_Msk)
	  {
		// Simple receive, this never happens :(
		//mainDummy = USART1->RDR;
		fifoPut(&lpuart1In, LPUART1->RDR);
	  }

	  #ifdef LPUART1_TX_PIN
	  // TXE (transmit empty)
	  if (tmp & USART_ISR_TXE_Msk)
	  {
		if (!fifoIsEmpty(&lpuart1Out))
		{
		  LPUART1->TDR = fifoTake(&lpuart1Out);
		}
		else
		{
		  // We are done sending, disables further tx empty interrupts.
		  LPUART1->CR1 &= ~(USART_CR1_TXEIE_Msk);
		}
	  }
	  #endif
	}
	#endif

	#ifdef USART1_BAUDRATE
	void __attribute__ ((interrupt, used)) USART1_IRQHandler(void)
	{
	  volatile uint32_t tmp = USART1->ISR;

	  // RXNE (Receive not empty)
	  if (tmp & USART_ISR_RXNE_Msk)
	  {
		// Simple receive, this never happens :(
		//mainDummy = USART1->RDR;
		fifoPut(&usart1In, USART1->RDR);
	  }

	  // TXE (transmit empty)
	  if (tmp & USART_ISR_TXE_Msk)
	  {
		if (!fifoIsEmpty(&usart1Out))
		{
		  USART1->TDR = fifoTake(&usart1Out);
		}
		else
		{
		  // We are done sending, disables further tx empty interrupts.
		  USART1->CR1 &= ~(USART_CR1_TXEIE_Msk);
		}
	  }
	}
	#endif

	#ifdef USART2_BAUDRATE
	void __attribute__ ((interrupt, used)) USART2_IRQHandler(void)
	{
	  volatile uint32_t tmp = USART2->ISR;

	  #ifdef USART2_RX_PIN
	  // RXNE (Receive not empty)
	  if (tmp & USART_ISR_RXNE_Msk)
	  {
		fifoPut(&usart2In, (int)(USART2->RDR & 0xFF));
	  }
	  #endif

	  #ifdef USART2_TX_PIN
	  // TXE (transmit empty)
	  if (tmp & USART_ISR_TXE_Msk)
	  {
		if (!fifoIsEmpty(&usart2Out))
		{
		  USART2->TDR = fifoTake(&usart2Out);
		}
		else
		{
		  // We are done sending, disables further tx empty interrupts.
		  USART2->CR1 &= ~(USART_CR1_TXEIE_Msk);

