xehp/hello_world_stm32/hello_stm32/src/serialDev.c
		  // This was just for testing, remove later...
		  //USART2->CR1 |= (USART_CR1_RXNEIE_Msk);
		}
	  }
	  #endif
	}
	#endif


	#ifdef USART3_BAUDRATE
	void __attribute__ ((interrupt, used)) USART3_IRQHandler(void)
	{
	  volatile uint32_t tmp = USART3->ISR;

	  // RXNE (Receive not empty)
	  if (tmp & USART_ISR_RXNE_Msk)
	  {
		// Simple receive, this never happens :(
		fifoPut(&usart3In, (int)(USART3->RDR & 0xFF));

		// For debugging count the RXNE interrupts.
		//mainCh++; // Remove this when things work.
	  }

	  // TXE (transmit empty)
	  if (tmp & USART_ISR_TXE_Msk)
	  {
		if (!fifoIsEmpty(&usart3Out))
		{
		  USART3->TDR = fifoTake(&usart3Out);
		}
		else
		{
		  // We are done sending, disables further tx empty interrupts.
		  USART3->CR1 &= ~(USART_CR1_TXEIE_Msk);
		}
	  }
	}
	#endif


#elif (defined STM32L151xB)

	void __attribute__ ((interrupt, used)) USART1_IRQHandler(void)
	{
	  volatile uint32_t tmp = USART1->SR;

	  // RXNE (Receive not empty)
	  if (tmp & USART_SR_RXNE_Msk)
	  {
		// Simple receive, this never happens :(
		//mainDummy = USART1->RDR;
		fifoPut(&usart1In, USART1->DR);
	  }

	  // TXE (transmit empty)
	  if (tmp & USART_SR_TXE_Msk)
	  {
		if (!fifoIsEmpty(&usart1Out))
		{
		  USART1->DR = fifoTake(&usart1Out);
		}
		else
		{
		  // We are done sending, disables further tx empty interrupts.
		  USART1->CR1 &= ~(USART_CR1_TXEIE_Msk);
		}
	  }
	}

	#ifdef USART2_BAUDRATE
	void __attribute__ ((interrupt, used)) USART2_IRQHandler(void)
	{
	  volatile uint32_t tmp = USART2->SR;

	  #ifdef USART2_RX_PIN
	  // RXNE (Receive not empty)
	  if (tmp & USART_SR_RXNE_Msk)
	  {
		fifoPut(&usart2In, (int)(USART2->DR & 0xFF));
	  }
	  #endif

	  #ifdef USART2_TX_PIN
	  // TXE (transmit empty)
	  if (tmp & USART_SR_TXE_Msk)
	  {
		if (!fifoIsEmpty(&usart2Out))
		{
		  USART2->DR = fifoTake(&usart2Out);
		}
		else
		{
		  // We are done sending, disables further tx empty interrupts.
		  USART2->CR1 &= ~(USART_CR1_TXEIE_Msk);

		  // This was just for testing, remove later...
		  //USART2->CR1 |= (USART_CR1_RXNEIE_Msk);
		}
	  }
	  #endif
	}
	#endif

	#ifdef USART3_BAUDRATE
	void __attribute__ ((interrupt, used)) USART3_IRQHandler(void)
	{
	  volatile uint32_t tmp = USART3->SR;

	  // RXNE (Receive not empty)
	  if (tmp & USART_SR_RXNE_Msk)
	  {
		fifoPut(&usart3In, (int)(USART3->DR & 0xFF));
	  }

	  // TXE (transmit empty)
	  if (tmp & USART_SR_TXE_Msk)
	  {
		if (!fifoIsEmpty(&usart3Out))
		{
		  USART3->DR = fifoTake(&usart3Out);
		}
		else
		{
		  // We are done sending, disables further tx empty interrupts.
		  USART3->CR1 &= ~(USART_CR1_TXEIE_Msk);
		}
	  }
	}
	#endif


#endif

/* This seems to work fine, we do get what the Nucleo sends */
void setupIoPinTx(GPIO_TypeDef *base, uint32_t pin, uint32_t alternateFunction)
{
    uint32_t tmp = 0x00;

    /*
    Alternate function register.
    Set it to USART2. Remember to set the port mode to alternate mode also.
    */
    const uint32_t afrIndex = pin >> 3;
    const uint32_t afrOffset = (pin & 0x7) * 4;
    tmp = base->AFR[afrIndex];
    tmp &= ~(15U << afrOffset);
    tmp |= alternateFunction << afrOffset;
    base->AFR[afrIndex] = tmp;
  
    /* [1]
    Configure IO Direction mode (Input, Output, Alternate or Analog)
    00: Input mode 
    01: General purpose output mode
    10: Alternate function mode
    11: Analog mode (reset state)
    Need the alternate mode in this case. See also AFR.
    */
    const uint32_t mode = 2U;
    tmp = base->MODER;
    tmp &= ~(3U << (pin * 2));
    tmp |= (mode << (pin * 2));
    base->MODER = tmp;

    /* [1]
    Configure the IO Speed
    00: Low speed (reset state for most IO pins)
    01: Medium speed
    10: High speed
    11: Very high speed (reset state for PA13)
    */
    const uint32_t speed = 2U;
    tmp = base->OSPEEDR;
    tmp &= ~(3U << (pin * 2));
    tmp |= (speed << (pin * 2));
    base->OSPEEDR = tmp;

    /* [1]
    Configure the IO Output Type
    0: Output push-pull (reset state)
    1: Output open-drain
    */
    //const uint32_t ot = 2U;
    //tmp = GPIOA->OTYPER;
    //tmp &= ~(1U << (pin * 1));
    //tmp |= (ot << (pin * 1));
    //GPIOA->OTYPER = tmp;

    /* [1]
    Activate the Pull-up or Pull down resistor for the current IO 
    00: No pull-up, pull-down (reset state for most IO pins)
    01: Pull-up
    10: Pull-down
    11: Reserved
    */
    //tmp = GPIOA->PUPDR;
    //tmp &= ~(3U << (pin * 2));
    //tmp |= (GPIO_NOPULL << (pin * 2));
    //GPIOA->PUPDR = tmp;
}

/**
 * Perhaps both TX and RX pins can be configured the same way.
 * If so only one method setupIoPinRxTx should be needed.
 * */
void setupIoPinRx(GPIO_TypeDef *base, uint32_t pin, uint32_t alternateFunction)
{
    uint32_t tmp = 0x00;

    /*
    Alternate function register.
    Set it to USART2. Remember to set the port mode to alternate mode also.
    */
    const uint32_t afrIndex = pin >> 3;
    const uint32_t afrOffset = (pin & 0x7) * 4;
    tmp = base->AFR[afrIndex];
    tmp &= ~(15U << afrOffset);
    tmp |= alternateFunction << afrOffset;
    base->AFR[afrIndex] = tmp;
  
    /* 
    Configure IO Direction mode (Input, Output, Alternate or Analog)
    00: Input mode 
    01: General purpose output mode
    10: Alternate function mode
    11: Analog mode (reset state)
    Need the alternate mode in this case. See also AFR.
    I think it shall be alternate mode but perhaps it shall be input mode?
    */
    const uint32_t mode = 2U;
    tmp = base->MODER;
    tmp &= ~(3U << (pin * 2));
    tmp |= (mode << (pin * 2));
    base->MODER = tmp;

    /*
    Configure the IO Speed
    00: Low speed (reset state for most IO pins)
    01: Medium speed
    10: High speed
    11: Very high speed (reset state for PA13)
    */
    const uint32_t speed = 2U;
    tmp = base->OSPEEDR;
    tmp &= ~(3U << (pin * 2));
    tmp |= (speed << (pin * 2));
    base->OSPEEDR = tmp;

    /* 
    Configure the IO Output Type
    0: Output push-pull (reset state)
    1: Output open-drain
    Some examples use push-pull others open-drain, did not notice any difference.
    This pin is for input anyway so this should not matter.
    */
    //tmp = GPIOA->OTYPER;
    //tmp &= ~(1U << (pin * 1));
    //tmp |= (1U << (pin * 1)); 
    //GPIOA->OTYPER = tmp;

