xehp/hello_world_stm32/hello_stm32/src/serialDev.c
	/*
	 [1] chapter 36.8.1 Control register 1 (USART_CR1)
	 36.8.12 USART register map
	 8-bit character length: M[1:0] = 00, that is default.
	 1 stop bit is the default value of number of stop bits.
	 That is what we want. So skipping those settings.
	 */

	/*
	 OVER8
	 0: Oversampling by 16 (default)
	 1: Oversampling by 8
	 */
	//usartPtr->CR1 |= (1 << 15);
	/*
	 Select the desired baud rate using the USART_BRR register.
	 https://community.st.com/thread/46664-setting-the-baudrate-for-usart-in-stm32f103rb
	 Ref [1] chapter 36.5.4 USART baud rate generation
	 */
	uint32_t divider = SysClockFrequencyHz / baud;
	/*if (divider<0x300)
	 {
	 return -1;
	 }*/
	usartPtr->BRR = divider;

	/* Enable uart transmitter and receiver */
	usartPtr->CR1 |= USART_CR1_TE_Msk | USART_CR1_RE_Msk;

	// Bit 1 UESM: USART enable in Stop mode
	// just testing, this should not be needed in this example.
	//usartPtr->CR1 |= USART_CR1_UESM_Msk;

	// We may need to invert RX line if we use a simple optocoupler
	// That is done in CR2 Bit 16 RXINV like this:
	// usartPtr->CR2 |= USART_CR2_RXINV_Msk;
	// No we may need to invert TX line:
	// usartPtr->CR2 |= USART_CR2_TXINV_Msk;

	/*
	 In asynchronous mode, the following bits must be kept cleared:
	 - LINEN and CLKEN bits in the USART_CR2 register,
	 - SCEN, HDSEL and IREN  bits in the USART_CR3 register.
	 */
	//USART2->CR2 &= ~(USART_CR2_LINEN_Msk | USART_CR2_CLKEN_Msk);
	//USART2->CR3 &= ~(USART_CR3_SCEN_Msk | USART_CR3_HDSEL_Msk | USART_CR3_IREN_Msk);
	usartPtr->CR2 &= ~(USART_CR2_CLKEN_Msk);

	sysBusyWait(1);

	//Set Usart1 interrupt priority. Lower number is higher priority.
	//uint32_t prioritygroup = NVIC_GetPriorityGrouping();
	//NVIC_SetPriority(USART2_IRQn, NVIC_EncodePriority(prioritygroup, 45, 0));
	const int irqN = usartGetIrqN(usartNr);
	NVIC_SetPriority(irqN, (1UL << __NVIC_PRIO_BITS) - 1UL);

	// This one helped.
	// https://community.st.com/thread/19735
	// I was missing to do NVIC_EnableIRQ.
	NVIC_EnableIRQ(irqN);

	/* Enable the Peripheral */
	usartPtr->CR1 |= USART_CR1_UE_Msk;

	/*
	 Shall interrupt be enabled before or after usart is enabled?
	 Did not notice any difference doing this before or after.
	 RXNEIE
	 0: Interrupt is inhibited
	 1: A USART interrupt is generated whenever ORE=1 or RXNE=1 in the USART_ISR
	 */
	usartPtr->CR1 |= USART_CR1_RXNEIE_Msk;

	return 0;
}
#endif

// Returns zero if OK.
int serialInit(int usartNr, uint32_t baud)
{
	switch(usartNr)
	{
		#ifdef LPUART1_BAUDRATE
		case DEV_LPUART1: return lpuartInit(baud);
		#endif
		#ifdef USART1_BAUDRATE
		case DEV_USART1: return initUsart123(usartNr, baud);
		#endif
		#ifdef USART2_BAUDRATE
		case DEV_USART2: return initUsart123(usartNr, baud);
		#endif
		#ifdef USART3_BAUDRATE
		case DEV_USART3: return initUsart123(usartNr, baud);
		#endif
		default: break;
	}
	return -1;
}


#ifdef LPUART1_TX_PIN
static inline void lpuart1Put(int ch)
{
	fifoPut(&lpuart1Out, ch);
	LPUART1->CR1 |= USART_CR1_TXEIE_Msk;
}
#endif

#if (defined USART1_BAUDRATE)
static inline void usart1Put(int ch)
{
	fifoPut(&usart1Out, ch);
	/*
	Now we need to trigger the ISR. Its done by enabling transmitter empty interrupt (it is empty so).
	TXEIE
	0: Interrupt is inhibited
	1: A USART interrupt is generated whenever TXE=1 in the USART_ISR register
	*/
	USART1->CR1 |= USART_CR1_TXEIE_Msk;
}
#endif

#if (defined USART2_BAUDRATE) && (defined USART2_TX_PIN)
static inline void usart2Put(int ch)
{
	// If FIFO is full shall we wait or not?
	// Comment out lines below if not.
	//while (fifoIsFull(usart2Out))
	//{
	//	systemSleep();
	//}

	fifoPut(&usart2Out, ch);
	// Now we need to trigger the ISR. Its done by enabling transmitter empty interrupt (it is empty so).
	USART2->CR1 |= USART_CR1_TXEIE_Msk;
}
#endif

#ifdef USART3_BAUDRATE
static inline void usart3Put(int ch)
{
	// If FIFO is full shall we wait or not?
	// Comment out lines below if not.
	//while (fifoIsFull(usart3Out))
	//{
	//	systemSleep();
	//}

	fifoPut(&usart3Out, ch);
	// Now we need to trigger the ISR. Its done by enabling transmitter empty interrupt (it is empty so).
	USART3->CR1 |= USART_CR1_TXEIE_Msk;
}
#endif


// Ref [1] chapter 36.5.2 USART transmitter
void serialPutChar(int usartNr, int ch)
{
	switch(usartNr)
	{
		#ifdef LPUART1_TX_PIN
		case DEV_LPUART1:
			lpuart1Put(ch);
			break;
		#endif
		#if (defined USART1_BAUDRATE)
		case DEV_USART1:
			usart1Put(ch);
			break;
		#endif
		#ifdef USART2_BAUDRATE
		case DEV_USART2:
			usart2Put(ch);
			break;
		#endif
		#ifdef USART3_BAUDRATE
		case DEV_USART3:
			usart3Put(ch);
			break;
		#endif
		default:
			// Ignore this.
		break;
	}
}

int serialGetChar(int usartNr)
{
	switch(usartNr)
	{
		#ifdef LPUART1_BAUDRATE
		case DEV_LPUART1:
			if (!fifoIsEmpty(&lpuart1In))
			{
				return fifoTake(&lpuart1In);
			}
			return -1;
		#endif
		#if (defined USART1_BAUDRATE)
		case DEV_USART1:
			if (!fifoIsEmpty(&usart1In))
			{
				return fifoTake(&usart1In);
			}
			return -1;
		#endif
		#if (defined USART2_BAUDRATE) && (defined USART2_RX_PIN)
		case DEV_USART2:
			if (!fifoIsEmpty(&usart2In))
			{
				return fifoTake(&usart2In);
			}
			return -1;
		#endif
		#ifdef USART3_BAUDRATE
		case DEV_USART3:
			if (!fifoIsEmpty(&usart3In))
			{
				return fifoTake(&usart3In);
			}
			return -1;
		#endif
		default:
			return -1;
		break;
	}
}

#ifdef LPUART1_TX_PIN
static inline void usartWriteLpuart1(const char *str, int msgLen)
{
	while (msgLen>0)
	{
		lpuart1Put(*str++);
	    msgLen--;
	}
}
#endif

#if (defined USART1_BAUDRATE)
static inline void usartWriteUart1(const char *str, int msgLen)
{
	while (msgLen>0)
	{
		usart1Put(*str++);
	    msgLen--;
	}
}
#endif

#ifdef USART2_BAUDRATE
static inline void usartWriteUart2(const char *str, int msgLen)
{
	while (msgLen>0)
	{
		usart2Put(*str++);
	    msgLen--;
	}
}
#endif

#ifdef USART3_BAUDRATE
static inline void usartWriteUart3(const char *str, int msgLen)
{
	while (msgLen>0)
	{
		usart3Put(*str++);
	    msgLen--;
	}
}
#endif


void serialWrite(int usartNr, const char *str, int msgLen)
{
	switch(usartNr)
	{
		#ifdef LPUART1_TX_PIN
		case DEV_LPUART1:
			usartWriteLpuart1(str, msgLen);
			break;
		#endif
		#if (defined USART1_BAUDRATE)
		case DEV_USART1:
			usartWriteUart1(str, msgLen);
			break;
		#endif
		#ifdef USART2_BAUDRATE
		case DEV_USART2:
			usartWriteUart2(str, msgLen);
			break;
		#endif
		#ifdef USART3_BAUDRATE
		case DEV_USART3:
			usartWriteUart3(str, msgLen);
			break;
		#endif
		default:
			/*
			while (msgLen>0)
			{
			    serialPutChar(usartNr, *str++);
			    msgLen--;
			}
			*/
			// ignore this
			break;
	}
}

void serialPrint(int usartNr, const char *str)
{
	while(*str)
	{
		serialPutChar(usartNr, *str++);
	}
}

void serialPrintInt64(int usartNr, int64_t num)
{
	char str[64];
	misc_lltoa(num, str, 10);
	serialPrint(usartNr, str);
}

int serialGetFreeSpaceWriteBuffer(int usartNr)
{
	switch(usartNr)
	{
		#if (defined LPUART1_BAUDRATE) && (defined LPUART1_TX_PIN)
		case DEV_LPUART1:
			fifoPut(&lpuart1Out, ch);
			return fifo_free_space(&usart1Out);
		#endif
		#if (defined USART1_BAUDRATE)
		case DEV_USART1:
			return fifo_free_space(&usart1Out);
		#endif
		#if (defined USART2_BAUDRATE) && (defined USART2_TX_PIN)
		case DEV_USART2:
			return fifo_free_space(&usart2Out);
		#endif
		#ifdef USART3_BAUDRATE
		case DEV_USART3:
			return fifo_free_space(&usart3Out);
		#endif
		default:
			// Ignore this.
		break;
	}
	return 0;
}


static const int hex[]={'0','1','2','3','4','5','6','7', '8','9','A','B','C','D','E','F'};

void serialPrintHex4(int usartNr, uint8_t i)
{
	serialPutChar(usartNr, hex[i&0xf]);
}

void serialPrintHex8(int usartNr, uint8_t i)
{
	serialPrintHex4(usartNr, i>>4);
	serialPrintHex4(usartNr, i&0xf);
}

void serialPrintHex16(int usartNr, uint16_t i)
{
	serialPrintHex8(usartNr, i>>8);
	serialPrintHex8(usartNr, i&0xff);
}

void serialPrintHex32(int usartNr, uint32_t i)
{
	serialPrintHex16(usartNr, i>>16);
	serialPrintHex16(usartNr, i&0xffff);
}

void serialPrintHex64(int usartNr, uint64_t i)
{
	serialPrintHex32(usartNr, i>>32);
	serialPrintHex32(usartNr, i&0xffffffff);
}

